name = input("Как тебя зовут? Введи имя: ")
print('Добро пожаловать в папин Квест,', name)
print('Ты оказался в незнакомом помещении')
print('Перед тобой 3 двери с номерами на них: 1, 2 или 3.')
while True:
    print('Дверь из которой можно выбраться - не крайняя, в какую пройдете? Введите цифру: ')
    otv1 = input()
    if otv1 == '2':
        print('Пройдя в эту дверь, она захлопнулась. Выхода нет. Game over.')
        print('Никто не говорил, что двери стоят по порядку счета, АХАХАХХАХ...')
        continue
    elif otv1 == '1':
        print('Ты шагнул в пропасть', name)
        print('Как приятно тебя побеждать, АХАХАХХАХ...')
        continue
    if otv1 == '3':
        print('ты прошел первый уровень', name)
        print('Выход отсюда не возможен через 2 двери.')
        print('Дверь справа под номером 1, дверь слева под номером 2,')
        print('над дверью слева написано: выход в дверь не рядом с номером 2.')
        print('Введите номер:')
    if otv1 in ('1', '2', '3'):
        break
    print('Не знаю такого действия. Введи корректный ответ.')
while otv1 == '3':
    otv2 = input()
    if otv2 == '1':
        print(name, 'Тебя сьел беззубый кролик! нельзя быть таким доверчивым')
        print('Вернись и попробуй!')
        continue
    elif otv2 == '2':
        print('Ура ты снова проиграл. Ты знаешь в какую дверь надо было бежать!')
        print('Вернись и попробуй!')
        continue
    if otv2 == '3':
        print('молодец',name,', ну наконец-то ты выбрался и сбежал. Береженого бог бережет')
        print('Поздравляю! Теперь осталось определиться кто здесь главный:')
    if otv2 in ('1', '2', '3'):
        break
    print('Не знаю такого действия. Введи корректный ответ.')
while otv2 == '3':
    otv3 = input()
    if otv3 == 'я':
        print(name, 'уверяю тебя, что это не так!')
        print('мой топор доказывает это путем отрубания твоей головы!')
        continue
    elif otv3 == 'ты':
        print('Ура и опять мимо. Спроси у мамы!')
        print('Мама решает!')
        continue
    if otv3 == 'мама':
        print('хвалю тебя',name,', мама позволяет тебе пройти дальше.')
        print('и мы снова перед тремя дверьми. 1 ведет на улицу. 2 учит тебя программировать на пайтон. 3 расскажет про создателя этого квеста. Какую выбираешь?:')
    if otv3 in ('я', 'ты', 'мама'):
        break
    print('Не знаю такого действия. Введи корректный ответ.')
while otv3 == 'мама':
    otv4 = input()
    if otv4 == '1':
        print(name, 'улица, фонарь аптека! вот и не стало человека')
        print('правильный выбор. иди гуляй и играй в мяч. нечего прогить')
        continue
    elif otv4 == '2':
        print('ура ты победил! теперь качай модули анаконды и учись со мной пайтону')
        print('Мама все равно решает!')
        continue
    if otv4 == '3':
        print('хвалю тебя',name,', меня зовут Иван.')
        print('Я никогда раньше не программировал, а уж тем более не знал кто такие gamedev. Однако это не помешало мне за три часа освоить азы программирования на пайтон! это очень интересно и предлагаю тебе попробовать.')
    if otv4 in ('1', '2', '3'):
        continue
    print('Не знаю такого действия. Введи корректный ответ.')
